src/test/resources/xml/transform1-request.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:bus="http://bus.cinimex.ru">
   <soapenv:Header/>
   <soapenv:Body>
      <bus:inputTransform1>
         <userList>       
           <user>
            <name>ARS</name>
            <age>29</age>
            <interestList>
              <interest>
                <name>Diving</name>
                <messagesCount>5</messagesCount>
              </interest>
              <interest>
                <name>Music</name>
                <messagesCount>5</messagesCount>
              </interest>
              <interest>
                <name>Sport</name>
                <messagesCount>2</messagesCount>
              </interest>
             <interest>
                <name>Travel</name>
                <messagesCount>1</messagesCount>
              </interest>
            </interestList>
            <messagesCount>5</messagesCount>
           </user>   
           <user>
            <name>ARS2</name>
            <age>25</age>
            <interestList>
              <interest>
                <name>Sport</name>
                <messagesCount>2</messagesCount>
              </interest>
              <interest>
                <name>Music</name>
                <messagesCount>5</messagesCount>
              </interest>
              <interest>
                <name>Travel</name>
                <messagesCount>2</messagesCount>
              </interest>
            </interestList>
            <messagesCount>3</messagesCount>
           </user>      
         </userList>
      </bus:inputTransform1>
   </soapenv:Body>
</soapenv:Envelope>